#pragma once
#include "../GameObject.h"
#include "System/Singleton/ResourceManager/ResourceManager.h"

// 前方宣言.
class MeshBase;

/****************************************************************************
*	メッシュオブジェクトクラス.
****************************************************************************/
class MeshObject
	: public GameObject
{
public:
	MeshObject();
	virtual ~MeshObject()override;

	virtual void Update() override;
	virtual void LateUpdate() override;
	virtual void Draw() override;
	void DrawDepth();

	/************************************************************************
	* @brief メッシュを接続.
	* @param pMesh：接続するメッシュ.
	************************************************************************/
	void AttachMesh(const std::shared_ptr<MeshBase>& pMesh);


	/************************************************************************
	* @brief メッシュを切り離す.
	************************************************************************/
	void DetachMesh();

public: // Getter、Setter.

	/************************************************************************
	* @brief 接続メッシュ名を取得.
	************************************************************************/
	const std::string GetResourceName() const;

	
	/************************************************************************
	* @brief 接続メッシュ名を取得.
	************************************************************************/
	const std::weak_ptr<MeshBase> GetAttachMesh() const {
		return m_pMesh;
	};


	/******************************************************************
	* @brief ライトを使用するか設定.
	******************************************************************/
	void SetIsLight(const bool& isLight);


	/******************************************************************
	* @brief 影を落とすか設定.
	******************************************************************/
	void SetIsShadow(const bool& isShadow);


	/************************************************************************
	* @brief アニメーション速度を設定.
	************************************************************************/
	void SetAnimSpeed(const double& speed);


	/************************************************************************
	* @brief アニメーションを変更.
	************************************************************************/
	void SetIsLoop(const bool& isLoop);

	
	/************************************************************************
	* @brief アニメーションを変更.
	************************************************************************/
	void ChangeAnim(const int& index);


	/************************************************************************
	* @brief アニメーション終了時間を取得.
	************************************************************************/
	const double GetAnimPeriod(const int& index) const;


private:
	/************************************************************************
	* ループするかを考慮したアニメーション再生.
	************************************************************************/
	void IsLoopAnimTimeSet();


	/************************************************************************
	* @brief 交差位置のポリゴンの頂点を見つける.
	************************************************************************/
	HRESULT FindVerticesOnPoly(
		LPD3DXMESH pMesh,
		DWORD dwPolyIndex,
		DirectX::XMFLOAT3* pVertices);

protected:
	std::weak_ptr<MeshBase>			m_pMesh;

	bool m_IsLight;	// ライトを使用するか.
	bool m_IsShadow;// 影を落とすか.

	// SkinMesh用.
	LPD3DXANIMATIONCONTROLLER	m_pAnimCtrl;//アニメーションコントローラ.		

	int							m_AnimNo;	//アニメーション番号.
	double						m_AnimSpeed; // アニメーション速度.
	double						m_AnimTimer;// アニメ―ション経過時間.
	bool						m_Isloop;	// アニメーションをループするか.
	DirectX::XMFLOAT3			m_BonePos;	// ボーン座標.
};